log/2015-03-16-11.43.25.log

Execute Anonymous

================================

MetadataService.MetadataPort service = MetadataUtils.createService();

List<String> layoutNames = new List<String>{
	Utils.addNamespace('TeamRaiser_Registration__c-TeamRaiser Registration Layout')};

List<MetadataService.Layout> requestedLayouts = (List<MetadataService.Layout>)service.readMetadata('Layout', layoutNames).getRecords();

System.debug('requested layouts: ' + requestedLayouts);

================================

31.0 APEX_CODE,DEBUG;APEX_PROFILING,DEBUG;CALLOUT,INFO;DB,INFO;VALIDATION,INFO;WORKFLOW,INFO
Execute Anonymous: MetadataService.MetadataPort service = MetadataUtils.createService();
Execute Anonymous: 
Execute Anonymous: List<String> layoutNames = new List<String>{
Execute Anonymous: 	Utils.addNamespace('TeamRaiser_Registration__c-TeamRaiser Registration Layout')};
Execute Anonymous: 
Execute Anonymous: List<MetadataService.Layout> requestedLayouts = (List<MetadataService.Layout>)service.readMetadata('Layout', layoutNames).getRecords();
Execute Anonymous: 
Execute Anonymous: System.debug('requested layouts: ' + requestedLayouts);
09:43:24.804 (804118568)|EXECUTION_STARTED
09:43:24.804 (804128919)|CODE_UNIT_STARTED|[EXTERNAL]|execute_anonymous_apex
09:43:24.941 (941668784)|METHOD_ENTRY|[2]|01po0000003Oh7F|MetadataUtils.MetadataUtils()
09:43:24.941 (941756019)|METHOD_EXIT|[2]|MetadataUtils
09:43:24.941 (941799862)|METHOD_ENTRY|[1]|01po0000003Oh7F|MetadataUtils.createService()
09:43:24.947 (947468855)|CONSTRUCTOR_ENTRY|[9]|01po0000003Oh7D|<init>()
09:43:24.947 (947957969)|CONSTRUCTOR_EXIT|[9]|01po0000003Oh7D|<init>()
09:43:24.947 (947992365)|CONSTRUCTOR_ENTRY|[11]|01po0000003Oh7D|<init>()
09:43:24.948 (948078803)|CONSTRUCTOR_EXIT|[11]|01po0000003Oh7D|<init>()
09:43:24.952 (952612050)|METHOD_EXIT|[1]|01po0000003Oh7F|MetadataUtils.createService()
09:43:24.986 (986679970)|METHOD_ENTRY|[1]|01po0000000dllI|Utils.Utils()
09:43:24.987 (987625029)|METHOD_EXIT|[1]|Utils
09:43:24.987 (987659047)|METHOD_ENTRY|[3]|01po0000000dllI|Utils.addNamespace(String)
09:43:24.991 (991630175)|METHOD_ENTRY|[1]|01po0000000dlkU|Constants.Constants()
09:43:25.011 (1011182411)|METHOD_EXIT|[1]|Constants
09:43:25.011 (1011219419)|METHOD_EXIT|[3]|01po0000000dllI|Utils.addNamespace(String)
09:43:25.011 (1011351355)|METHOD_ENTRY|[6]|01po0000003Oh7D|MetadataService.MetadataPort.readMetadata(String, List<String>)
09:43:25.014 (1014546049)|CONSTRUCTOR_ENTRY|[8869]|01po0000003Oh7D|<init>()
09:43:25.014 (1014688150)|CONSTRUCTOR_EXIT|[8869]|01po0000003Oh7D|<init>()
09:43:25.021 (1021044710)|CALLOUT_REQUEST|[8875]|<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Header><SessionHeader xmlns="http://soap.sforce.com/2006/04/metadata"><sessionId>00Do0000000HyRH!AQYAQEvTBxdD59kQcX68mhGCV.AL4gE8X6jl3quIKwOjC9Rt2VrlU0QOZSBkq8Sh0ajJETmfDsw7nTrO3tWtAr9pqj6HXf7I</sessionId></SessionHeader></env:Header><env:Body><readMetadata xmlns="http://soap.sforce.com/2006/04/metadata"><type>Layout</type><fullNames>TeamRaiser_Registration__c-TeamRaiser Registration Layout</fullNames></readMetadata></env:Body></env:Envelope>
09:43:25.021 (1021101189)|CALLOUT_REQUEST|[8875]|readMetadata_element:[apex_schema_type_info=(http://soap.sforce.com/2006/04/metadata, true, false), field_order_type_info=(type_x, fullNames), fullNames=(TeamRaiser_Registration__c-TeamRaiser Registration Layout), fullNames_type_info=(fullNames, http://soap.sforce.com/2006/04/metadata, null, 0, -1, false), type_x=Layout, type_x_type_info=(type, http://soap.sforce.com/2006/04/metadata, null, 1, 1, false)]::SFDC_STACK_DEPTH=1 SOAPAction="" User-Agent=SFDC-Callout/33.0 Accept=text/xml Content-Type=text/xml; charset=UTF-8 
09:43:25.217 (1217114955)|CALLOUT_RESPONSE|[8875]|<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://soap.sforce.com/2006/04/metadata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><readMetadataResponse><result><records xsi:type="Layout"><fullName>TeamRaiser_Registration__c-TeamRaiser Registration Layout</fullName><excludeButtons>Submit</excludeButtons><layoutSections><customLabel>true</customLabel><detailHeading>true</detailHeading><editHeading>true</editHeading><label>TeamRaiser Progress</label><layoutColumns><layoutItems><height>420</height><page>TeamRaiserProgressWidget</page><showLabel>false</showLabel><showScrollbars>false</showScrollbars><width>100%</width></layoutItems></layoutColumns><style>OneColumn</style></layoutSections><layoutSections><customLabel>false</customLabel><detailHeading>false</detailHeading><editHeading>true</editHeading><label>Information</label><layoutColumns><layoutItems><behavior>Required</behavior><field>Name</field></layoutItems><layoutItems><behavior>Required</behavior><field>Contact__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Participation_Type__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Participant_s_Home_Page__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Registration_Date__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Opportunity__c</field></layoutItems><layoutItems><behavior>Required</behavior><field>TeamRaiser_Participation_Type__c</field></layoutItems></layoutColumns><layoutColumns><layoutItems><behavior>Edit</behavior><field>Fundraising_Goal__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Total_Raised__c</field></layoutItems><layoutItems><behavior>Required</behavior><field>Campaign__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Team_Captain__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Team__c</field></layoutItems></layoutColumns><style>TwoColumnsTopToBottom</style></layoutSections><layoutSections><customLabel>true</customLabel><detailHeading>false</detailHeading><editHeading>false</editHeading><label>Separator</label><layoutColumns><layoutItems><behavior>Required</behavior><field>Registration_Fee__c</field></layoutItems></layoutColumns><layoutColumns><layoutItems><behavior>Required</behavior><field>Extra_Gift__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Upsell_Amount__c</field></layoutItems></layoutColumns><style>TwoColumnsLeftToRight</style></layoutSections><layoutSections><customLabel>false</customLabel><detailHeading>true</detailHeading><editHeading>true</editHeading><label>System Information</label><layoutColumns><layoutItems><behavior>Readonly</behavior><field>CreatedById</field></layoutItems></layoutColumns><layoutColumns><layoutItems><behavior>Readonly</behavior><field>LastModifiedById</field></layoutItems></layoutColumns><style>TwoColumnsTopToBottom</style></layoutSections><layoutSections><customLabel>true</customLabel><detailHeading>false</detailHeading><editHeading>false</editHeading><label>Custom Links</label><layoutColumns/><layoutColumns/><layoutColumns/><style>CustomLinks</style></layoutSections><relatedLists><fields>OPPORTUNITY.NAME</fields><fields>ACCOUNT.NAME</fields><fields>OPPORTUNITY.CLOSE_DATE</fields><fields>OPPORTUNITY.AMOUNT</fields><relatedList>Opportunity.TeamRaiser_Registration__c</relatedList></relatedLists><relatedLists><fields>NAME</fields><fields>Upsell_Item__c</fields><fields>Item_Price__c</fields><fields>Item_Quantity__c</fields><fields>Total_Amount__c</fields><fields>Date_Fulfilled__c</fields><relatedList>TeamRaiser_Registration_Upsell__c.TeamRaiser_Registration__c</relatedList></relatedLists><showEmailCheckbox>false</showEmailCheckbox><showHighlightsPanel>false</showHighlightsPanel><showInteractionLogPanel>false</showInteractionLogPanel><showRunAssignmentRulesCheckbox>false</showRunAssignmentRulesCheckbox><showSubmitAndAttachButton>false</showSubmitAndAttachButton><summaryLayout><masterLabel>00ho0000000pGUP</masterLabel><sizeX>4</sizeX><sizeY>0</sizeY><summaryLayoutStyle>Default</summaryLayoutStyle></summaryLayout></records></result></readMetadataResponse></soapenv:Body></soapenv:Envelope>
09:43:25.239 (1239210620)|CONSTRUCTOR_ENTRY|[4077]|01po0000003Oh7D|<init>()
09:43:25.239 (1239420108)|CONSTRUCTOR_EXIT|[4077]|01po0000003Oh7D|<init>()
09:43:25.262 (1262964150)|CALLOUT_RESPONSE|[8875]|
09:43:25.263 (1263139206)|METHOD_ENTRY|[8888]|01po0000003Oh7D|MetadataService.readLayoutResponse_element.getResult()
09:43:25.263 (1263169697)|METHOD_EXIT|[8888]|01po0000003Oh7D|MetadataService.readLayoutResponse_element.getResult()
09:43:25.263 (1263179795)|METHOD_EXIT|[6]|01po0000003Oh7D|MetadataService.MetadataPort.readMetadata(String, List<String>)
09:43:25.263 (1263265858)|METHOD_ENTRY|[6]|01po0000003Oh7D|MetadataService.ReadLayoutResult.getRecords()
09:43:25.263 (1263281732)|METHOD_EXIT|[6]|01po0000003Oh7D|MetadataService.ReadLayoutResult.getRecords()
09:43:25.265 (1265295911)|USER_DEBUG|[8]|DEBUG|requested layouts: (FullName: TeamRaiser_Registration__c-TeamRaiser Registration Layout
customButtons: null
headers: null
Sections: (customLabel: true &#124; label: TeamRaiser Progress &#124; detailHeading: true &#124; style: OneColumn &#124; layoutColumns: (LayoutItems: (LayoutItem: 
page_x: TeamRaiserProgressWidget scontrol: null
)
) 
 , customLabel: false &#124; label: Information &#124; detailHeading: false &#124; style: TwoColumnsTopToBottom &#124; layoutColumns: (LayoutItems: (LayoutItem: 
page_x: null scontrol: null
, LayoutItem: 
page_x: null scontrol: null
, LayoutItem: 
page_x: null scontrol: null
, LayoutItem: 
page_x: null scontrol: null
, LayoutItem: 
page_x: null scontrol: null
, LayoutItem: 
page_x: null scontrol: null
, LayoutItem: 
page_x: null scontrol: null
)
, LayoutItems: (LayoutItem: 
page_x: null scontrol: null
, LayoutItem: 
page_x: null scontrol: null
, LayoutItem: 
page_x: null scontrol: null
, LayoutItem: 
page_x: null scontrol: null
, LayoutItem: 
page_x: null scontrol: null
)
) 
 , customLabel: true &#124; label: Separator &#124; detailHeading: false &#124; style: TwoColumnsLeftToRight &#124; layoutColumns: (LayoutItems: (LayoutItem: 
page_x: null scontrol: null
)
, LayoutItems: (LayoutItem: 
page_x: null scontrol: null
, LayoutItem: 
page_x: null scontrol: null
)
) 
 , customLabel: false &#124; label: System Information &#124; detailHeading: true &#124; style: TwoColumnsTopToBottom &#124; layoutColumns: (LayoutItems: (LayoutItem: 
page_x: null scontrol: null
)
, LayoutItems: (LayoutItem: 
page_x: null scontrol: null
)
) 
 , customLabel: true &#124; label: Custom Links &#124; detailHeading: false &#124; style: CustomLinks &#124; layoutColumns: (LayoutItems: null
, LayoutItems: null
, LayoutItems: null
) 
 )
relatedObjects: null
relatedLists: (RelatedListItem:[apex_schema_type_info=(http://soap.sforce.com/2006/04/metadata, true, false), customButtons=null, customButtons_type_info=(customButtons, http://soap.sforce.com/2006/04/metadata, null, 0, -1, false), excludeButtons=null, excludeButtons_type_info=(excludeButtons, http://soap.sforce.com/2006/04/metadata, null, 0, -1, false), field_order_type_info=(customButtons, excludeButtons, fields, relatedList, sortField, sortOrder), fields=(OPPORTUNITY.NAME, ACCOUNT.NAME, OPPORTUNITY.CLOSE_DATE, OPPORTUNITY.AMOUNT), fields_type_info=(fields, http://soap.sforce.com/2006/04/metadata, null, 0, -1, false), relatedList=Opportunity.TeamRaiser_Registration__c, relatedList_type_info=(relatedList, http://soap.sforce.com/2006/04/metadata, null, 1, 1, false), sortField=null, sortField_type_info=(sortField, http://soap.sforce.com/2006/04/metadata, null, 0, 1, false), sortOrder=null, sortOrder_type_info=(sortOrder, http://soap.sforce.com/2006/04/metadata, null, 0, 1, false)], RelatedListItem:[apex_schema_type_info=(http://soap.sforce.com/2006/04/metadata, true, false), customButtons=null, customButtons_type_info=(customButtons, http://soap.sforce.com/2006/04/metadata, null, 0, -1, false), excludeButtons=null, excludeButtons_type_info=(excludeButtons, http://soap.sforce.com/2006/04/metadata, null, 0, -1, false), field_order_type_info=(customButtons, excludeButtons, fields, relatedList, sortField, sortOrder), fields=(NAME, Upsell_Item__c, Item_Price__c, Item_Quantity__c, Total_Amount__c, Date_Fulfilled__c), fields_type_info=(fields, http://soap.sforce.com/2006/04/metadata, null, 0, -1, false), relatedList=TeamRaiser_Registration_Upsell__c.TeamRaiser_Registration__c, relatedList_type_info=(relatedList, http://soap.sforce.com/2006/04/metadata, null, 1, 1, false), sortField=null, sortField_type_info=(sortField, http://soap.sforce.com/2006/04/metadata, null, 0, 1, false), sortOrder=null, sortOrder_type_info=(sortOrder, http://soap.sforce.com/2006/04/metadata, null, 0, 1, false)])
miniLayout null
)
09:43:25.522 (1267643297)|CUMULATIVE_LIMIT_USAGE
09:43:25.522|LIMIT_USAGE_FOR_NS|(default)|
  Number of SOQL queries: 0 out of 100
  Number of query rows: 0 out of 50000
  Number of SOSL queries: 0 out of 20
  Number of DML statements: 0 out of 150
  Number of DML rows: 0 out of 10000
  Maximum CPU time: 0 out of 10000
  Maximum heap size: 0 out of 6000000
  Number of callouts: 1 out of 100
  Number of Email Invocations: 0 out of 10
  Number of future calls: 0 out of 50
  Number of queueable jobs added to the queue: 0 out of 50
  Number of Mobile Apex push calls: 0 out of 10

09:43:25.522|CUMULATIVE_LIMIT_USAGE_END

09:43:25.267 (1267672266)|CODE_UNIT_FINISHED|execute_anonymous_apex
09:43:25.268 (1268889691)|EXECUTION_FINISHED